app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "HEY Ya'LL"], ["body", "POST"], ["created_at", "2016-05-01 23:59:28.652963"], ["updated_at", "2016-05-01 23:59:28.652963"]]